# Data Preprocessing

- Working with data downloaded as of Jan 20, 2022
- Source: https://open.toronto.ca/dataset/ttc-routes-and-schedules/
- `agency` table from raw dataset is ignored as it only contains meta-data
- raw data files are in text (.txt) format
- processed data saved in feather (.ftr) format to reduce I/O speed and file size

In [1]:
import pandas as pd

In [2]:
# list of raw data file names

data_tables = ['calendar_dates', 'calendar', 'routes', 'shapes', 'stop_times', 'stops', 'trips']

In [3]:
# import csv data

for table in data_tables:
    globals()[table] = pd.read_csv(f'raw-data/ttc-schedule-data/{table}.txt')

In [4]:
# delete redundant and empty columns (columns with one or none unique values)

for table in data_tables:
    print(f'Scanning table {table}...')
    table_df = globals()[table]
    for column in table_df:
        num = table_df[column].nunique()
        if (num == 0):
            table_df.drop(columns = column, inplace = True)
            print('*')
            print('Deleted column', column, 'for being empty')
        elif (num == 1):
            unique_value = table_df[column].iloc[0]
            table_df.drop(columns = column, inplace = True)
            print('*')
            print('Deleted column', column, 'for having only one unique value:')
            print(unique_value)
    print()

Scanning table calendar_dates...

Scanning table calendar...
*
Deleted column start_date for having only one unique value:
20211010
*
Deleted column end_date for having only one unique value:
20211120

Scanning table routes...
*
Deleted column agency_id for having only one unique value:
1
*
Deleted column route_desc for being empty
*
Deleted column route_url for being empty

Scanning table shapes...

Scanning table stop_times...
*
Deleted column stop_headsign for being empty

Scanning table stops...
*
Deleted column stop_desc for being empty
*
Deleted column zone_id for being empty
*
Deleted column stop_url for being empty
*
Deleted column location_type for being empty
*
Deleted column parent_station for being empty
*
Deleted column stop_timezone for being empty

Scanning table trips...
*
Deleted column trip_short_name for being empty
*
Deleted column wheelchair_accessible for having only one unique value:
1

## Export tables (original data with empty/redundant columns removed)

In [5]:
# export dataframes

for table in data_tables:
    globals()[table].to_feather(f'data/store/{table}.ftr')

# trips

In [6]:
trips.bikes_allowed.value_counts()

# circle back to add a filter for bike access

1    113303
2     18637
Name: bikes_allowed, dtype: int64

In [7]:
trips.block_id.value_counts().count()

# each block_id represents trips made by a single vehicle

5688

In [8]:
trips.direction_id.value_counts()

# 1 = opposite direction
# 0 = default direction
# this might be useful later, but not required for MVP

1    66115
0    65825
Name: direction_id, dtype: int64

In [9]:
trips.shape_id.value_counts().count()

# each shape_id represents the line followed by vehicles
# leave in for now as shape_id might represent the unique route-stop combinations

1375

In [10]:
# brute force check to confirm that each shape_id represents a unique combination of stop_id and stop_sequence
# for i in trips.shape_id:
#     if (stop_times[stop_times.trip_id.isin(trips[trips.shape_id == i].trip_id)].stop_sequence.value_counts().value_counts().count() != 1):
#         print(i)

# takes long to run, over 5 min+
# but no records were found to match

In [11]:
trips = trips.drop(columns = ['bikes_allowed', 'block_id', 'direction_id'])

In [12]:
trips.shape

(131940, 5)

In [13]:
trips.head(1)

,route_id,service_id,trip_id,trip_headsign,shape_id
0,64815,1,42990014,EAST - 10 VAN HORNE towards VICTORIA PARK,886388

In [14]:
# filter to trips only made during regular weekday service
# is_trips => in service trips
is_trips = trips[trips.service_id == 1].drop(columns = 'service_id').reset_index(drop = True)
is_trips.shape

(41016, 4)

In [15]:
is_trips.head(1)

   route_id   trip_id                              trip_headsign  shape_id
0     64815  42990014  EAST - 10 VAN HORNE towards VICTORIA PARK    886388

# stop_times

In [16]:
stop_times.shape

(4311631, 8)

In [17]:
# confirm that arrival time & departure time values are the same
(stop_times.arrival_time == stop_times.departure_time).value_counts()

True    4311631
dtype: int64

In [18]:
stop_times.shape_dist_traveled.value_counts().sort_index()

# represents the distance traveled for by the vehicle making this trip
# might be useful for analysis later, but at the moment does not serve any purpose for our MVP

0.0003      212
0.0019       47
0.0036      112
0.0051      136
0.0054      189
           ...
37.3567      35
37.4393     913
37.5943     867
38.2679       3
38.9837    1780
Name: shape_dist_traveled, Length: 26389, dtype: int64

In [19]:
display(stop_times.pickup_type.value_counts())
print()
display(stop_times.drop_off_type.value_counts())

# 0 = regular service
# 1 = no service
# need to circle back and filter pathfinding around these stops which are marked as 1
# perhaps it might be as simple as to remove these from stop_times table

0    4306516
1       5115
Name: pickup_type, dtype: int64

0    4310638
1        993
Name: drop_off_type, dtype: int64

In [20]:
# keep only one of arrival/departure time since they are equal
stop_times = stop_times.drop(columns = ['departure_time', 'shape_dist_traveled', 'pickup_type', 'drop_off_type'])
stop_times = stop_times.rename(columns = {'arrival_time': 'stop_time'})

In [21]:
stop_times.head(1)

    trip_id stop_time  stop_id  stop_sequence
0  42990004   7:00:29    14155              1

In [22]:
is_stop_times = stop_times[stop_times.trip_id.isin(is_trips.trip_id)].reset_index(drop = True)
is_stop_times.shape

(1304782, 4)

# stops

In [23]:
stops.shape

(9476, 6)

In [24]:
stops.wheelchair_boarding.value_counts()

# circle back to add a user filter for wheelchair access

1    8002
2    1474
Name: wheelchair_boarding, dtype: int64

In [25]:
stops = stops.drop(columns = 'wheelchair_boarding')

In [26]:
stops.head(1)

   stop_id  stop_code                  stop_name   stop_lat   stop_lon
0      262        662  Danforth Rd at Kennedy Rd  43.714379 -79.260939

In [27]:
is_stops = stops[stops.stop_id.isin(is_stop_times.stop_id)].reset_index(drop = True)
is_stops.shape

(9419, 5)

# routes

In [28]:
routes.shape

(208, 6)

In [29]:
routes.route_type.value_counts()

# 3 = bus
# 0 = streetcar / light rail
# 1 = subway

3    191
0     13
1      4
Name: route_type, dtype: int64

In [30]:
routes[routes.route_type == 1]

# note that Line 1 with yellow route_color is the only route 
# with text color as black, rest have their text color as white

,route_id,route_short_name,route_long_name,route_type,route_color,route_text_color
0,65024,1,LINE 1 (YONGE-UNIVERSITY),1,D5C82B,000000
52,65025,2,LINE 2 (BLOOR - DANFORTH),1,008000,FFFFFF
62,65026,3,LINE 3 (SCARBOROUGH),1,108BEF,FFFFFF
104,65027,4,LINE 4 (SHEPPARD),1,B300B3,FFFFFF

In [31]:
routes.route_color.value_counts()

# color names in order: blue, green, light blue, dark purple, light purple, orange, yellow, olive, bright green

FF0000    141
0000FF     31
008000     29
00FF00      1
D5C82B      1
800080      1
808000      1
108BEF      1
FF8040      1
B300B3      1
Name: route_color, dtype: int64

In [32]:
routes.route_text_color.value_counts()

# color names in order: white, black

FFFFFF    207
000000      1
Name: route_text_color, dtype: int64

In [33]:
routes = routes.drop(columns = ['route_type', 'route_color', 'route_text_color'])

In [34]:
routes.head(1)

   route_id  route_short_name            route_long_name
0     65024                 1  LINE 1 (YONGE-UNIVERSITY)

In [35]:
is_routes = routes[routes.route_id.isin(is_trips.route_id)].reset_index(drop = True)
is_routes.shape

(205, 3)

## Tables below not required for MVP

In [36]:
calendar.head(1)

   service_id  monday  tuesday  wednesday  thursday  friday  saturday  sunday
0           1       1        1          1         1       1         0       0

In [37]:
calendar_dates.head(1)

   service_id      date  exception_type
0           4  20211011               1

In [38]:
shapes.head(1)

,shape_id,shape_pt_lat,shape_pt_lon,shape_pt_sequence,shape_dist_traveled
0,886387,43.775608,-79.346046,1,0.0

## Minimize routes table by merging with trips

In [39]:
print(is_routes.shape)
is_routes.head(1)

(205, 3)

   route_id  route_short_name            route_long_name
0     65024                 1  LINE 1 (YONGE-UNIVERSITY)

In [40]:
print(is_trips.shape)
is_trips.head(1)

(41016, 4)

   route_id   trip_id                              trip_headsign  shape_id
0     64815  42990014  EAST - 10 VAN HORNE towards VICTORIA PARK    886388

In [41]:
is_trips = pd.merge(is_trips, is_routes, 'inner', 'route_id')

In [42]:
is_trips = is_trips[['trip_id', 'shape_id', 'route_short_name', 'route_long_name', 'trip_headsign']]
# rearrange columns and drop route_id as no longer required

In [43]:
is_trips.head(1)

,trip_id,shape_id,route_short_name,route_long_name,trip_headsign
0,42990014,886388,10,VAN HORNE,EAST - 10 VAN HORNE towards VICTORIA PARK

## Create a master stop_times table with all data merged from trips & stops

In [44]:
is_stop_times.shape, is_trips.shape, is_stops.shape

((1304782, 4), (41016, 5), (9419, 5))

In [45]:
schedule = pd.merge(is_stop_times, is_trips, 'inner', 'trip_id')

In [46]:
schedule = pd.merge(schedule, stops, 'inner', 'stop_id')

In [47]:
schedule[['trip_id', 'stop_sequence']].value_counts()

trip_id   stop_sequence
43128797  5                1
43003167  39               1
          32               1
          33               1
          34               1
                          ..
43015153  34               1
          35               1
          36               1
          37               1
42990004  1                1
Length: 1304782, dtype: int64

In [48]:
schedule.head(1)

,trip_id,stop_time,stop_id,stop_sequence,shape_id,route_short_name,route_long_name,trip_headsign,stop_code,stop_name,stop_lat,stop_lon
0,42990004,7:00:29,14155,1,886387,10,VAN HORNE,EAST - 10 VAN HORNE towards VICTORIA PARK,14633,Don Mills Station,43.776222,-79.347048

In [49]:
schedule = schedule[['trip_id', 'shape_id', 'stop_sequence', 'stop_time', 'stop_id', 'stop_lat', 'stop_lon', 'stop_code', 'stop_name', 'route_short_name', 'route_long_name', 'trip_headsign']]
# route_id removed as no longer relevant, no need for external reference as all data has been merged here (unlike stop_id which is required for model)
# also route_id has a 1-1 relationship with route_short_name and can act as a key on its own

In [50]:
schedule = schedule.sort_values(by = ['trip_id', 'shape_id', 'stop_sequence']).reset_index(drop = True)

# Convert and save stop_time as a timedelta value

In [51]:
# create new time delta value
is_stop_times['stop_time_delta'] = pd.to_timedelta(is_stop_times.stop_time)
schedule['stop_time_delta'] = pd.to_timedelta(schedule.stop_time)

In [52]:
# reorder columns
is_stop_times = is_stop_times[['trip_id', 'stop_sequence', 'stop_id', 'stop_time', 'stop_time_delta']]
schedule = schedule[['trip_id', 'route_short_name', 'route_long_name', 'shape_id', 'trip_headsign', 'stop_sequence', 'stop_time', 'stop_time_delta', 'stop_id', 'stop_code', 'stop_name', 'stop_lat', 'stop_lon']]
is_stops = is_stops[['stop_id', 'stop_code', 'stop_name', 'stop_lat', 'stop_lon']]

In [53]:
is_trips = is_trips.sort_values(by = 'trip_id').reset_index(drop = True)
is_stops = is_stops.sort_values(by = 'stop_id').reset_index(drop = True)
is_stop_times = is_stop_times.sort_values(by = ['trip_id', 'stop_sequence']).reset_index(drop = True)
schedule = schedule.sort_values(by = ['trip_id', 'stop_sequence']).reset_index(drop = True)

## Final data format

In [54]:
schedule.head(1)

,trip_id,route_short_name,route_long_name,shape_id,trip_headsign,stop_sequence,stop_time,stop_time_delta,stop_id,stop_code,stop_name,stop_lat,stop_lon
0,42990004,10,VAN HORNE,886387,EAST - 10 VAN HORNE towards VICTORIA PARK,1,7:00:29,0 days 07:00:29,14155,14633,Don Mills Station,43.776222,-79.347048

In [55]:
is_stop_times.head(1)

    trip_id  stop_sequence  stop_id stop_time stop_time_delta
0  42990004              1    14155   7:00:29 0 days 07:00:29

In [56]:
is_trips.head(1)

,trip_id,shape_id,route_short_name,route_long_name,trip_headsign
0,42990004,886387,10,VAN HORNE,EAST - 10 VAN HORNE towards VICTORIA PARK

In [57]:
is_stops.head(1)

   stop_id  stop_code                  stop_name   stop_lat   stop_lon
0      262        662  Danforth Rd at Kennedy Rd  43.714379 -79.260939

## Export data (as needed to build model)

In [58]:
is_trips.to_feather('data/model/trips.ftr')
is_stops.to_feather('data/model/stops.ftr')
is_stop_times.to_feather('data/model/stop_times.ftr')
schedule.to_feather('data/model/schedule.ftr')